MoonModules/projectMM/src/platform/esp32/platform_esp32_moon_i80.cpp
/// @defgroup platform_esp32_moon_i80 MoonI80: parallel WS2812 over LCD_CAM
/// Parallel WS2812 output over the S3 and P4 LCD_CAM i80 peripheral, sequenced by our own DMA.
///
/// This file owns the peripheral alone: the registers, the GDMA channel and its descriptor chain, the frame buffers, transmit and wait.
/// The driver above it does the domain work, and the esp_lcd sibling beside it is the behavioral reference this matches function for function.
///
/// @moreinfo
///
/// ## Why this exists next to the esp_lcd backend
///
/// That component re-arms the peripheral on every transaction, resetting the bus and busy-waiting before each one.
/// An LCD panel does not care, but WS2812 is one unbroken self-clocked bit stream, so a mid-frame reset garbles everything after it.
/// A frame split across several transactions therefore cannot be sent gaplessly at any chunk size, which forces the whole frame into one.
/// That is what caps the sibling: the DMA must stream an entire frame from one contiguous reachable block.
///
/// ## The hardware never demanded it
///
/// The peripheral has no data-length register, and the SDK's own comment says the data phase is controlled by the buffer length.
/// So it clocks out exactly what the DMA feeds it and stops when the chain ends.
/// One start over an arbitrarily long descriptor chain is a single gapless stream across as many buffers as we like.
/// This backend takes that, built on the SDK's own hardware and link-list interfaces rather than raw registers, which keeps it a recognisable construct.
///
/// ## Both implementations ship
///
/// The esp_lcd one is the reference and this one is the measured alternative, selected as a module swap in the interface.
/// The guard is the narrow capability macro rather than the sibling's broad one, since this pokes registers the classic chip does not have.
/// Its i80 is a different peripheral with a different register file entirely, so the stubs are inert there and the build list stays unconditional.
///
/// ## The shift clock window
///
/// What constrains the clock is the WS2812 slot duration rather than the elegance of the divider, the slot being the zero pulse.
/// An expander shifts each slot out over several bus words, so the slot is that multiplier divided by the pixel clock.
/// The specified zero pulse runs to 380 ns on newer revisions and the one pulse from 580 to 1000 ns.
/// Three settings were taken to the wall, and the default is the middle one.
///
/// ```
/// div 3  26.67 MHz  zero 300 ns, bit 900 ns   strict spec, but marginal strands scramble
/// div 4  20.00 MHz  zero 400 ns, bit 1200 ns  the reliability point, verified on two rigs
/// div 5  16.00 MHz  zero 500 ns               crosses the threshold: every bit reads one, all white
/// ```
///
/// Div 3 is the overclock for short-wired rigs chasing the higher ceiling, measured at 151 frames against 118.
/// Long runs under capacitive load cannot track it, and raising the drive strength does not help, both measured: it is bandwidth-bound rather than edge-bound.
/// Div 4 gives the expander a third more shift margin, which is why hpwit ships his own driver near that rate.
/// Calibration is per wall: sweep up from the default until marginal strands are clean, and all white means one step too far.
///
/// ## The ring's geometry is runtime
///
/// The lights per buffer and the pool depth arrive as parameters, because the optimum is a measurement rather than a derivation.
/// Memory is the only axis wanting a small buffer, and three others want it big.
///
/// ```
/// memory          lights x depth x row bytes; flat only at one light per buffer
/// per-call cost   the encode seam's fixed overhead, amortised over the buffer
/// interrupt rate  one per buffer: 25.6k/s at one light, 1.6k/s at sixteen
/// lap-time runway how long a preemption may last before the DMA laps a refilling buffer
/// ```
///
/// A busy interrupt on the first core starves the network stack, measured as a 19 ms encode killing ethernet on the LC16.
/// Bench history worth keeping: at sixteen lights per buffer the pool only ever held about twelve, which caps that geometry near 240 lights per strand.
/// A depth of two broke transport outright, the loopback failing at the first bit, because our chain runs without the owner gate that scheme relies on.
///
/// ## The scatter above eight slices, resolved
///
/// It read as an unknown mechanism at the time and was two knowable per-hardware faults the ring counters are structurally blind to.
/// The inter-slice pad latched the strand, a LOW gap over the reset threshold repainting the first lights of every slice.
/// And the producer needed headroom over the consumer, which the near-prime pool provides.
/// With the automatic geometry and a latch-safe pad, the full wall streams clean, verified.
///
/// The lasting lesson is that without the owner check there is no handshake, so a torn or short read raises no error at all.
/// Timings look healthy and the error count stays zero, so a correct geometry drawn in scattered dots reads as a latch fault rather than a data fault.
/// Do not trust a ring counter for that class: the wall, or the loopback bit-verify, is the instrument.
///
/// ## Where the frame lives is decided by the pixel clock
///
/// Measured on one board with one variable changed, which is the cleanest result of the whole investigation.
/// In direct mode a frame in external memory streams fine; in expander mode it never completes, at any size.
/// So it is neither the memory nor the frame size: the transfer engine cannot sustain an external read at the expander's clock.
/// An expander is serial, so each slot shifts out over eight bus words and the bus runs ten times faster, which is exactly the rate that memory cannot feed.
///
/// This backend is what proved it, and is why it was built.
/// The sibling failed here with thousands of descriptor-mount errors that pointed hard at its own descriptor handling.
/// This one removes that mechanism entirely, owning the chain and mounting it once, and the mount errors are gone while the transfer still never completes.
/// So that storm was a symptom rather than the cause, killed by a controlled experiment with a working control condition.
///
/// Hence internal memory first in expander mode and external first otherwise, which is what the measurement says rather than a workaround inherited from the sibling.
/// External stays the fallback there, so a frame too big to fit still drives badly rather than refusing to start.
///
/// ## The interrupt does the encode, and must never touch flash
///
/// The handler runs in the transfer interrupt and its ring branch calls the domain encode, so the whole chain is resident in instruction memory.
/// The channel is registered cache-safe, a deliberate shipped hardening: the interrupt fires at the wire rate, so a cache miss inside it would blow the refill deadline.
/// Being cache-safe, it may fire while the flash cache is disabled by a write, so the slice encode must not touch anything flash-resident.
/// The refill defers when the cache is off and the batch catches up afterwards.
/// Do not remove that guard or move the encode back to flash: either reintroduces the measured cache-error panic.
///
/// ## Why completion is reported on written, not drained
///
/// The hardware ends the frame, the terminator sitting on the final slice, so there is no software stop and no post-frame interrupt to catch.
/// Completion is therefore reported the instant the last slice is written.
/// From there the frame's fate is sealed: the engine drains the rest at the exact wire rate and stops itself.
/// That dodges the coalescing trap which wedged the older drain-keyed stop, where two late interrupts latch into one and the firing that would have observed the end never arrives.
/// A drain-gated completion then deadlocks, the halted engine firing nothing further, measured as flicker and then no output.
///
/// A stall-truncated frame cannot be reported as a clean completion: reaching that branch means an interrupt fired, and one fires only while the engine runs.
/// A stall long enough to truncate is one where the engine halted at the frontier.
/// The handler never runs again for that frame, so its completion comes from the backstop instead.
///
/// ## Only the data lines reach a pad
///
/// The routing fabric is not a broadcast: a peripheral signal never connected to a pad stays inside the peripheral.
/// So the lanes a board does not use, and both bus control lines, cost no pins at all.
/// The peripheral clocks every lane whatever the pin count, but those past the board's count go nowhere.
/// Which the sibling component cannot do: it rejects an unconnected data pin and must park spares on a real ghost pin.
///
/// The data-command line separates command from data on a panel, a concept a strand does not have, and it is nailed to a constant level in every phase.
/// The write strobe must still be generated, being the clock that shifts each bus word out and drives an expander, but only a shift register consumes it.
/// A strand is self-clocked, so in direct mode it ignores the strobe entirely and that needs no pad either.
/// A direct-mode board therefore spends its pins on strands alone, which is the budget the hand-rolled drivers have always had.
///
/// ## The chain is ours, so the owner check protects nothing
///
/// The sibling component leaves owner-checking on, which makes a mount walk from the start and refuse at the first descriptor the engine still owns.
/// That is the mount failure which makes its path unusable with a large expanded frame.
/// We own the chain outright and rebuild it from scratch on every transmit, so the check protects nothing and only fails.
///
/// ## The frontier-terminated chain
///
/// The pool is a fixed set of node runs, one per buffer, mounted linear with a spare tail the arm re-links, and it is not a loop.
/// The chain always ends at a terminator sitting on the last written slice: the arm plants it at the prime edge and the interrupt advances it as it refills.
/// So the engine can never run past written data. Reaching the end of the encoded slices it halts there, lines idle low, and the strand latches a partially-updated frame.
///
/// That replaces the earlier looping chain, where a deferred refill let the engine lap the pool and re-clock stale slices as bright garbage.
/// It is also why the original linear chain stalled beyond a certain length: it revisited buffers with no live terminator to advance.
/// So the engine reached a node it could not pass and halted mid-frame.
/// A moving frontier is the fix that both a fixed terminator and a bare loop lacked.
///
/// Every node carries rows and nothing else, since the bit stream must flow continuously from buffer to buffer.
/// A trailing low pad on any mid-chain buffer is a gap long enough to latch the strand, which is the scrambled-image fault.
/// The reset gap is not in a buffer at all: it is the idle time after the halt, held by the next arm.
///
/// ## One buffer is one descriptor node
///
/// A buffer larger than a node's maximum spans several, and the per-buffer mount and re-link interaction then breaks the self-terminating end.
/// On the bench the terminator sat correctly on its node yet the engine stopped several nodes earlier, while the identical logic was clean at one node per buffer.
/// Clamping the buffer to fit one node deletes that class of bug instead of patching it, and small buffers are the direction the large walls want anyway.
///
/// ## Descriptor write-back stays off
///
/// With it on, the engine clears each descriptor's owner bit as it consumes the node.
/// On a chain whose buffers are refilled behind it, that leaves the engine gating on bits it cleared.
/// It then halts politely once it reaches a node it now thinks the processor owns.
/// That is the measured symptom of a clean stop after a number of interrupts with no error recorded.
/// The refill rewrites buffer contents and never the descriptor, so it never re-arms a bit; the fix is to never let the hardware clear them.
///
/// ## Where the frame lives is decided by the pixel clock
///
/// Measured on one board with one variable changed, and the cleanest result of the whole investigation.
/// Same board, same memory, same chain, same driver: in direct mode a frame in external memory streams fine, and in expander mode it never completes at any size.
/// So it is neither the memory nor the frame size: the engine cannot sustain an external read at the expander's clock.
/// An expander is serial, so each slot shifts out over eight bus words and the bus must run ten times faster, which is exactly the rate that memory cannot feed.
///
/// This backend is what proved it, which is why it was built.
/// The sibling failed here with thousands of descriptor-mount errors that pointed hard at its own handling.
/// This one removes that mechanism entirely and the errors are gone, yet the transfer still never completes.
/// So that storm was a symptom rather than the cause, killed by a controlled experiment with a working control condition.
///
/// Hence internal memory first in expander mode and external first otherwise, which caps the expander on this path at what fits internally.
/// Above that the driver does not use this path at all: it builds the streaming ring, which never materializes the frame.
///
/// ## Only the optional allocation is reserve-guarded
///
/// The reserve protects the network heap from an OPTIONAL allocation, and the frame itself is not optional.
/// Refusing it to keep the reserve intact would decline to drive the lights at all.
/// That degrades the essential thing to protect a nice-to-have, which inverts the policy.
///
/// With an expander there is no external fallback at all, internal or nothing.
/// Measured: a frame placed externally reports no output and burns a fifth of a second per tick timing out, while the same frame internally drives fine.
/// So such a fallback does not degrade, it WEDGES: init still succeeds, the driver reports driving, and every tick times out. Returning nothing instead surfaces the failure through the normal path.
///
/// ## Largest block, never total free
///
/// The whole-frame path allocates in one contiguous piece, so what matters is the largest free block: a fragmented heap can report megabytes free with no run big enough.
/// Using the total was a bug: at sixteen strands a 144 KB expander frame reported as fitting, so the ring was not chosen.
/// The contiguous allocation of those 144 KB then failed, fell back to external memory, and stalled at the expander clock.
/// The ring's own check deliberately uses free SIZE instead, since it makes many small allocations and needs no single run.
///
/// ## The wire is waited for, not refused
///
/// The peripheral holds exactly one transfer and the caller may legitimately hand over the next while one is still clocking out.
/// There is no queue to absorb it, and reprogramming the chain mid-walk would garble the frame, but refusing a busy bus would be wrong.
/// The double buffer's whole design is that the driver waits only on the buffer it is about to encode into.
/// At that point the other's transfer is quite legitimately still on the wire, and refusing there would drop every second frame.
/// Waiting here costs nothing that design was buying: its win is that the next encode overlapped the previous wire time, which has already happened by the time this is called.
/// What is left is the wire itself, which is serial on any design, the strand receiving one frame at a time.
///
/// ## The loopback follows the same rule the render path does
///
/// An expander test frame at the full light count lands in external memory and stalls at that clock on the whole-frame path.
/// The loopback would then time out and report nothing captured, blaming the transport for what is really a placement problem, and never testing the encode at all.
/// So when the frame will not fit internally it streams through the RING instead, exactly as the render path does, and the bit-verify then validates the actual ring output.
///
/// The ring's encode seam is a slice producer while the loopback already holds the whole pre-encoded frame.
/// So its encode is a copy of the matching slice out of that frame.
/// The row count must come from strand-side units: dividing by bus bytes mixes units and would build a ring for a fraction of the frame.
///
/// ## Two stall backstops, one recovery
///
/// On the ring path a cache-off window can outlast the pool's lead: the handler defers and the engine halts at the frontier.
/// A halted engine fires nothing further, so the completion never comes and the wait times out.
/// That is the designed benign outcome, the strand holding a partially-updated frame rather than replaying stale slices.
/// The frame must still be finalized, though, so the render thread proceeds.
/// It finalizes only once elapsed time proves the engine cannot still be mid-frame and the refills never reached the end, since a completed frame reports from the handler instead.
///
/// On the whole-frame path the completion interrupt is a latch that can very rarely be lost.
/// Two firings coalesce, or one races the next frame's reset, and the busy flag is left stuck.
/// Without recovery the bus wedges permanently, every later transmit blocking its full timeout and the driver's retry re-arming into the same state.
/// Here the condition is simply that the wait timed out with a transfer in flight, and the shared stop-and-clear does the rest.

