MoonModules/projectMM/src/platform/esp32/platform_esp32_moon_i80.cpp
#include "platform/platform.h"

#include "sdkconfig.h"
#include "soc/soc_caps.h"

#if SOC_LCDCAM_I80_LCD_SUPPORTED

#include "esp_attr.h"
#include "esp_cache.h"
#include "esp_private/cache_utils.h"   // spi_flash_cache_enabled — the cache-safe ISR's defer guard
#include "esp_clk_tree.h"
#include "esp_heap_caps.h"
#include "esp_log.h"
#include "esp_memory_utils.h"
#include "esp_rom_gpio.h"
#include "soc/gpio_sig_map.h"   // SIG_GPIO_OUT_IDX — detaches a matrix route (destroyState)
#include "esp_rom_sys.h"     // esp_rom_delay_us — the DMA-to-FIFO settle before lcd_ll_start
#include "esp_timer.h"       // esp_timer_get_time — ISR-safe wire-time stamp
#include "driver/gpio.h"
#include "soc/io_mux_reg.h"  // PIN_FUNC_GPIO — the IO-MUX function the matrix routes through
#include "freertos/FreeRTOS.h"
#include "freertos/semphr.h"

#include "hal/gdma_channel.h"          // SOC_GDMA_TRIG_PERIPH_LCD0 / _BUS (the GDMA_MAKE_TRIGGER operands)
#include "hal/lcd_hal.h"               // lcd_hal_context_t / lcd_hal_init
#include "hal/lcd_ll.h"                // the LCD_CAM low-level register API
#include "hal/lcd_periph.h"            // soc_lcd_i80_signals — the GPIO-matrix signal indices
#include "esp_private/gdma.h"          // channel alloc / connect / strategy / transfer / start
#include "esp_private/gdma_link.h"     // the descriptor link list (esp_lcd uses exactly this)
#include "esp_private/esp_dma_utils.h" // esp_dma_calculate_node_count
#include "esp_private/gpio.h"          // gpio_func_sel — the IO-MUX select esp_lcd's GPIO setup uses
#include "esp_private/periph_ctrl.h"   // PERIPH_RCC_ACQUIRE_ATOMIC / PERIPH_RCC_ATOMIC
#include "esp_private/esp_clk_tree_common.h"  // esp_clk_tree_enable_src — power the LCD clock source

#include <atomic>      // std::atomic_thread_fence — orders the frontier splice's two descriptor writes
#include <cstring>
#include <functional>  // the transmit callback passed to the shared frame loopback
#include <new>         // std::nothrow

namespace mm::platform {

// The plain-GPIO continuity pre-check, shared with the RMT loopback: the wire question is identical.
namespace detail { bool loopbackJumperOk(uint8_t txGpio, uint8_t rxGpio); }

namespace {

static const char* MOON_I80_TAG = "mm_moon_i80";

/// Three slots per bit at 375 ns, one slot HIGH for a zero: @xref{the-shift-clock-window|why 375 and not 416}.
constexpr uint32_t kPclkHz = 2'666'666;

/// The pixel clock with an expander fitted: @xref{the-shift-clock-window|the window and its three wall verdicts}.
constexpr uint8_t  kShiftClockDivDefault = 4;   // 80 MHz / 4 = 20 MHz
constexpr uint32_t kShiftBusResolutionHz = 80'000'000;   // PLL160M / kClockPreScale — the prescale base
// The live shift-clock prescale, a file-static because it is one global tuning knob rather than a per-call parameter.
uint8_t g_shiftClockDiv = kShiftClockDivDefault;

// The reset LOW, held as idle time between a frame's stop and the next arm rather than as clocked zeros, so it holds at any geometry for no extra memory.
constexpr int64_t kResetLowUs = 350;

// Flush slices past the close slice; file-scope so the completion and the backstop agree on the frame's last one.
constexpr uint32_t kTailBufs = 1;

// The group divider, restated rather than included because its header is private; kept identical to the sibling's so both produce the same waveform.
constexpr uint32_t kClockPreScale = 2;

// Max bytes one descriptor carries, so a full frame's chain costs a few hundred bytes: the chain is free.
constexpr size_t kDmaNodeMaxBytes = kRingNodeMaxBytes;

// The bus index; both chips have exactly one, and this backend owns it for the frame's duration.
constexpr int kBusId = 0;

// Ring mode: a closed chain over a few small internal buffers refilled as the DMA drains them, so it never reads external memory at the shift clock.
// That is the bound the whole-frame path hits once a frame no longer fits internally. See platform.h.

// Runtime geometry, both exposed as controls: @xref{the-rings-geometry-is-runtime|the four axes} and @xref{the-scatter-above-eight-slices-resolved|the scatter}.
// The shared bounds live in platform.h; here they size ring[] and gate the depth check.

// Backstop for a transmit arriving while the previous frame is still on the wire; it bounds a wedged peripheral so a broken DMA cannot hang the render thread.
constexpr uint32_t kWireFreeTimeoutMs = 200;

// The frame buffers, the peripheral, and the chain that streams one into the other.
// Two buffers for the deferred-wait double buffer, the second null when its allocation did not fit, each with its own completion signal.
// Transfers complete in start order and the event carries no token, so a two-slot queue of started indices routes each signal to the buffer that finished.
// There is no transaction queue, so a transmit programs the chain directly and a second one in flight is a caller error, rejected rather than queued.
struct MoonI80State {
    lcd_hal_context_t hal = {};
    gdma_channel_handle_t dma = nullptr;
    gdma_link_list_handle_t link = nullptr;
    SemaphoreHandle_t done[2] = {nullptr, nullptr};
    // Signals the wire is free, kept separate from the per-buffer ones the driver waits on: one producer and one consumer, so a binary semaphore fits exactly.
    SemaphoreHandle_t wireFree = nullptr;
    uint8_t* buf[2] = {nullptr, nullptr};
    size_t cap = 0;             // shared per-buffer capacity (both buffers equal)
    size_t busWidth = 8;        // 8 or 16 data lines
    uint32_t prescale = 1;      // pixel-clock prescale off the 80 MHz bus resolution
    bool clockAcquired = false; // the PERIPH_RCC bus-clock reference this state holds
    // The routes established at setup, kept so teardown can undo them: a deleted driver must leave no signal pointing at a freed peripheral.
    uint16_t routedPins[16] = {};   // data GPIOs routed to the bus (first `routedPinCount`)
    uint8_t  routedPinCount = 0;
    int32_t  routedWrGpio = -1;      // WR GPIO if routed (shift mode), else -1
    // In-order completion queue of started buffer indices, pushed by the transmit and popped by the interrupt; never more than one entry per buffer.
    volatile uint8_t fifo[2] = {0, 0};
    volatile uint8_t fifoHead = 0;   // next write slot (mod 2)
    volatile uint8_t fifoTail = 0;   // next read slot (mod 2)
    // Wire-time measurement: each in-flight transfer's start stamp and the last duration, paired with the queue so it tracks the right transfer.
    volatile int64_t txStartUs[2] = {0, 0};
    volatile uint32_t lastTransmitUs = 0;
    // When the peripheral last stopped, which is when the strand starts idling LOW and the reset begins.
    // The next arm waits that out, so the reset is real at any geometry.
    volatile int64_t lastStopUs = 0;
    volatile bool busy = false;      // a transfer is clocking out right now

    // --- Ring mode. Null/zero on a whole-frame handle; populated only by moonI80Ws2812InitRing. ------
    bool isRing = false;
    uint8_t* ring[kRingBufsMax] = {};   // the internal-RAM slice buffers the DMA loops over (first `ringBufs` used)
    uint8_t  ringBufs = 0;           // pool depth in use — the live count; kRingBufsMax is only the array bound
    uint32_t rowsPerBuf = 0;         // rows one ring buffer holds (the last SLICE may be shorter)
    uint32_t totalRows = 0;          // strand length in rows — the frame ends after this many
    size_t   linkItemCap = 0;        // descriptor-pool capacity — the mount loop must not exceed it (IDF wraps silently)
    uint32_t consumedItems = 0;      // descriptor items the mount loop actually used (diagnostic; == linkItemCap when sized right)
    // Descriptor nodes per buffer, since one larger than a node's maximum spans several.
    uint8_t  itemsPerBuf = 1;
    // The node the prime-only path mounts terminated, so the DMA ends the frame itself rather than a mid-frame stop racing the prefetcher. Diagnostic only.
    int32_t  termNode = -1;
    // Each buffer's ACTUAL last node, taken from the mount rather than computed: the mount may allocate a different count than predicted, and arithmetic terminated a buffer early.
    int32_t  bufLastNode[kRingBufsMax] = {};
    // Whether a buffer's constants were cleared, so a uniform-lane encoder can skip about a third of the refill cost on one whose constants still stand.
    bool     bufNeedsPrefill[kRingBufsMax] = {};
    size_t   ringRowBytes = 0;       // encoded bytes per row (encode writes rowsPerBuf × this per buffer)
    MoonI80EncodeFn   encode = nullptr;   // the domain's slice encoder (platform.h seam)
    void*             encodeUser = nullptr;
    // The clock oracle: the drain position is a function of TIME rather than of interrupt arrivals, since the DMA free-runs at the exact bus rate.
    // The interrupt is a latch and not a queue, so two under load coalesce into one firing and any per-firing counter undercounts.
    // Deriving the refill target from elapsed time makes a coalesced interrupt change only when work happens, never what gets written.
    volatile int64_t  armUs = 0;          // esp_timer time at gdma_start — the oracle's epoch, per frame
    uint32_t          sliceNs = 0;        // one slice's wire duration incl. the pad (bytes × 37.5 ns + padUs)
    // The refill cursor as a slice index, the mount order fixing which buffer each slice lives in; advanced in batches toward the writable window.
    volatile uint32_t lastWrittenSlice = 0;   // highest slice index already encoded (or zero-filled) this frame
    // One shared zero block every pad node points at.
    // A LOW gap under the latch threshold reads as a pause, stretching the refill deadline at a linear cost in frame time.
    uint8_t* zeroPad = nullptr;
    size_t   zeroPadBytes = 0;
    uint8_t  padUs = 0;
    // Cache facts hoisted out of the refill, the line size being a per-pool constant: querying it per refill was a flash call inside the interrupt.
    size_t   ringCacheLine = 0;
    uint32_t          nSlices = 0;        // total slices in the frame = ceil(totalRows / rowsPerBuf)
    volatile uint32_t drainCount = 0;     // DIAGNOSTIC ONLY: the oracle position the last EOF observed
    // Lifetime interrupt and completion counts, best-effort rather than a contract: they tell a stalled refill apart from no interrupts at all.
    volatile uint32_t dbgEofTotal = 0;
    volatile uint32_t dbgDoneGiven = 0;
    volatile uint32_t dbgLastDrain = 0;
    // Deferred refills and their worst consecutive run: the interrupt skips a refill whenever the flash cache is off, and a write outlasting the pool's lead corrupts a frame.
    volatile uint32_t dbgCacheOffDefers = 0;
    volatile uint32_t dbgCacheOffRun = 0;      // current consecutive-defer streak
    volatile uint32_t dbgCacheOffMaxRun = 0;   // worst streak seen (≈ how many buffers the DMA could lap)
    // Frames the backstop finalized after the DMA halted at the frontier during a stall: each is a partially-updated frame, the benign outcome the terminator exists to produce.
    volatile uint32_t dbgStallAbandons = 0;
    // A descriptor-error count, which turns an otherwise silent halt into a visible signal: above zero at a stall means the descriptor pool was corrupted.
    volatile uint32_t dbgDescErr = 0;
    // The worst refill time against the worst gap between interrupts: the one is the deadline the other must beat, which tells a pace problem from a cursor problem.
    volatile uint32_t dbgMaxEncodeUs = 0;
    // The average is the pace number and the maximum above is the jitter one; conflating them cost a day. Divided at readout, so the interrupt does no division.
    volatile uint32_t dbgEncSumUs = 0;
    volatile uint32_t dbgEncCount = 0;
    volatile uint32_t dbgEncAvgUs = 0;   // LAST FRAME's average, latched at frame end — the readout target
                                         // (reading sum/count mid-frame races the per-frame reset: the 1 s
                                         // KPI tick correlates with the frame cycle and kept landing in the
                                         // freshly-reset window, reading a false 0)
    volatile uint32_t dbgMaxIsrGapUs = 0;
    volatile int64_t  dbgLastEofUs = 0;
    // The scatter meter: slices written after their drain had begun, each stale on the wire. A clean soak reads zero, whether or not the eye catches it.
    volatile uint32_t dbgLate = 0;
};

// The descriptor-error callback, registered so a fetch fault is counted rather than ignored.
bool IRAM_ATTR moonI80DescErrCb(gdma_channel_handle_t, gdma_event_data_t*, void* user) {
    auto* st = static_cast<MoonI80State*>(user);
    st->dbgDescErr = st->dbgDescErr + 1u;
    return false;
}

