MoonModules/projectMM/src/platform/esp32/platform_esp32_moon_i80.cpp
// Forward declaration: the interrupt's ring branch refills the drained buffer by calling this.
void encodeRingSlice(MoonI80State* st, uint8_t slot, uint32_t firstRow, uint32_t count);
// The shared slice fill; the attribute goes on the definition only, since repeating it here conflicts the section.
bool fillSlice(MoonI80State* st, uint8_t slot, uint32_t sliceIdx);

// The node a buffer ends at, which is where the frontier terminator rests and where an inter-buffer link leaves from.
inline int ringTailNode(const MoonI80State* st, uint8_t b) {
    return st->bufLastNode[b] + (st->zeroPad ? 1 : 0);
}

// The completion callback: the chain reached its end node, so pop the oldest started index, record the wire duration and release that buffer's waiter.
// The event fires when the last bytes reach the peripheral's queue rather than the pins, which suits this contract: a wait gates reusing a buffer rather than reading the output.
// Resident in instruction memory, and the encode chain with it: @xref{the-interrupt-does-the-encode-and-must-never-touch-flash|the guard that must not be removed}.
bool IRAM_ATTR moonI80EofCb(gdma_channel_handle_t, gdma_event_data_t*, void* user) {
    auto* st = static_cast<MoonI80State*>(user);

    // Ring mode, in two shapes. When every slice was encoded before arming, only the terminator carries the end mark, so the one interrupt that arrives IS the frame's end.
    // When the frame laps the pool, every data node carries it and the handler is driven by elapsed time.
    // Not by its own arrival count, the interrupt being a latch where two coalesce into one firing.
    // Each firing refills every slice the writable window allows and advances the terminator, so a coalesced interrupt changes only when work happens, never what gets written.
    if (st->isRing) {
        BaseType_t high = pdFALSE;
        // The cache-off guard, the pattern the vendor's own cache-safe handlers use: @xref{the-interrupt-does-the-encode-and-must-never-touch-flash|why deferring is free}.
        if (!spi_flash_cache_enabled()) {
            // Cache off: this firing refills NOTHING and does NOT advance the frontier. Count it + track the
            // consecutive-defer streak (buffers drained un-refilled while the write holds). If the write
            // outlasts the pool's lead, the DMA reaches the frontier NULL and HALTS — the wait backstop then
            // finalizes the held frame (dbgStallAbandons). No stale-slice replay: the frontier is the guard.
            st->dbgCacheOffDefers = st->dbgCacheOffDefers + 1u;
            st->dbgCacheOffRun = st->dbgCacheOffRun + 1u;
            if (st->dbgCacheOffRun > st->dbgCacheOffMaxRun) st->dbgCacheOffMaxRun = st->dbgCacheOffRun;
            return false;
        }
        st->dbgCacheOffRun = 0;                          // a live firing ends the streak
        st->dbgEofTotal = st->dbgEofTotal + 1u;         // ISR INSTRUMENTATION (diagnostic)
        const int64_t eofNow = esp_timer_get_time();
        if (st->dbgLastEofUs != 0) {
            const uint32_t gap = static_cast<uint32_t>(eofNow - st->dbgLastEofUs);
            if (gap > st->dbgMaxIsrGapUs) st->dbgMaxIsrGapUs = gap;
        }
        st->dbgLastEofUs = eofNow;

        const bool primeOnly = st->nSlices <= st->ringBufs;
        if (!primeOnly && st->busy) {
            // The oracle: slices whose drain has COMPLETED. sliceNs is exact (bytes × 37.5 ns + pad), so
            // the only error source is esp_timer resolution — microseconds against a >100 µs slice.
            const uint32_t drainPos = static_cast<uint32_t>(
                ((eofNow - st->armUs) * 1000) / st->sliceNs);
            st->drainCount = drainPos;      // DIAGNOSTIC (dbgLastDrain mirrors the old counter's slot)
            st->dbgLastDrain = drainPos;

            // Batch refill toward the writable window: a slice's previous occupant is provably drained once the drain position has passed it, and a safety margin sets the edge.
            // Capped per firing to bound the handler's duration, and capped batches still converge since interrupts keep arriving.
            // The pool is the jitter buffer, so only the average encode must beat the deadline.
            constexpr uint32_t kLead = 2;
            constexpr uint32_t kBatchMax = 4;
            // kTailBufs (file scope): one pure-zero flush slice past the frame-close slice, so a stop firing
            // on the second-to-last EOF (oracle floor at a slice boundary) can only truncate zeros, never the
            // frame-close latch (which streams a whole slice earlier).
            const uint32_t windowEnd = drainPos + st->ringBufs - kLead;
            // The frame's last writes are the frame-close slice (index nSlices: zeros + the closing latch
            // word) and kTailBufs pure-zero flush slices. The frontier terminator then RESTS on the final
            // node as the frame's hardware end — the DMA cannot pass a NULL, so nothing past the frame is
            // ever re-read (no lap of zero-fill needed beyond it).
            const uint32_t lastSlice = st->nSlices + kTailBufs;
            for (uint32_t n = 0; n < kBatchMax; n++) {
                const uint32_t s = st->lastWrittenSlice + 1u;
                if (s > windowEnd || s > lastSlice) break;
                const uint32_t slot = s % st->ringBufs;
                // Stale-on-the-wire detector: the drain of slice s begins at drainPos == s, so filling at
                // or after that moment means the wire already clocked (part of) the OLD contents.
                if (drainPos >= s) st->dbgLate = st->dbgLate + 1u;
                const int64_t encStart = esp_timer_get_time();   // REUSE-RACE INSTRUMENTATION (diagnostic)
                const bool realEncode = fillSlice(st, static_cast<uint8_t>(slot), s);
                // Time only REAL encodes (fillSlice==true) — the `ea`/max pace numbers must reflect the
                // refill that has to beat the slice deadline, not the cheap past-frame zero-fills.
                if (realEncode) {
                    const uint32_t encUs = static_cast<uint32_t>(esp_timer_get_time() - encStart);
                    if (encUs > st->dbgMaxEncodeUs) st->dbgMaxEncodeUs = encUs;
                    st->dbgEncSumUs = st->dbgEncSumUs + encUs;    // average = sum/count at readout
                    st->dbgEncCount = st->dbgEncCount + 1u;
                }
                // The moving terminator: the chain always ends at the last written slice, the new frontier terminated first and the old one then extended into it.
                // In that order, with a fence between the two writes, there is never an instant where the chain runs past written data into a stale link.
                // A stalled refill therefore halts the engine at the frontier and the strand latches a partially-updated frame, instead of lapping the pool and re-clocking stale slices as bright garbage.
                // The link edit writes through a non-cacheable alias and needs no sync, and it runs only on the cache-on path.
                gdma_link_concat(st->link, ringTailNode(st, static_cast<uint8_t>(slot)), nullptr, 0);
                std::atomic_thread_fence(std::memory_order_release);
                gdma_link_concat(st->link, ringTailNode(st, static_cast<uint8_t>((s - 1u) % st->ringBufs)),
                                 st->link, st->bufLastNode[slot]);
                st->lastWrittenSlice = s;
            }

            // Frame end, reported on written rather than drained: @xref{why-completion-is-reported-on-written-not-drained|the coalescing trap this dodges}.
            // The engine is not stopped here, the terminator halting it, and stopping now would truncate the still-draining wire.
            // Fires exactly once per frame, the block being gated on the busy flag that the completion clears.
            if (st->lastWrittenSlice >= lastSlice) {
                st->busy = false;
                // Latch this frame's encode average and reset the window — at frame END, when every
                // refill has landed, so a readout never sees a half-filled (or just-reset) window.
                st->dbgEncAvgUs = st->dbgEncCount ? st->dbgEncSumUs / st->dbgEncCount : 0;
                st->dbgEncSumUs = 0;
                st->dbgEncCount = 0;
                // The wire finishes a whole frame's duration after the arm, and the reset begins there rather than at this earlier written moment.
                // The next arm waits out the real tail before re-arming, and the frame carries its flush slice too.
                // Omitting that would start the reset a slice early and release the barrier while it is still draining.
                const uint32_t frameWireUs = static_cast<uint32_t>(
                    (static_cast<uint64_t>(st->nSlices + kTailBufs) * st->sliceNs) / 1000u);
                st->lastStopUs = st->armUs + frameWireUs;
                st->lastTransmitUs = frameWireUs;
                st->dbgDoneGiven = st->dbgDoneGiven + 1u;
                xSemaphoreGiveFromISR(st->done[0], &high);   // the ring reports completion on slot 0
            }
        } else if (primeOnly && st->busy) {
            // The terminator's EOF — the frame's one interrupt. The chain has self-terminated at NULL.
            st->drainCount = st->nSlices;
            st->dbgLastDrain = st->nSlices;
            st->busy = false;
            st->lastStopUs = eofNow;
            st->lastTransmitUs = static_cast<uint32_t>(eofNow - st->txStartUs[0]);
            st->dbgDoneGiven = st->dbgDoneGiven + 1u;
            xSemaphoreGiveFromISR(st->done[0], &high);
        }
        return high == pdTRUE;
    }

