MoonModules/projectMM/src/platform/esp32/platform_esp32_moon_i80.cpp
// Route the peripheral's signals onto real pins: @xref{only-the-data-lines-reach-a-pad|why the control lines and spare lanes cost none}.
// So the data-command line is never routed, and the strobe only when an expander needs it on a pin.
void configureGpio(MoonI80State* st, const uint16_t* dataPins, uint8_t laneCount, uint16_t wrGpio,
                   bool routeWr) {
    const uint8_t n = laneCount < 16 ? laneCount : 16;
    for (size_t i = 0; i < laneCount; i++) {
        gpio_func_sel(static_cast<gpio_num_t>(dataPins[i]), PIN_FUNC_GPIO);
        esp_rom_gpio_connect_out_signal(dataPins[i], soc_lcd_i80_signals[kBusId].data_sigs[i],
                                        false, false);
        // Maximum drive strength on every routed pin, data and the expander's latch alike.
        // Strong pads mean sharp edges, which is what the register needs to sample cleanly over real strand wiring.
        // Marginal strands lose the most margin and the strongest edge buys it back.
        gpio_set_drive_capability(static_cast<gpio_num_t>(dataPins[i]), GPIO_DRIVE_CAP_3);
        if (i < n) st->routedPins[i] = dataPins[i];   // recorded for teardown (see destroyState)
    }
    st->routedPinCount = n;
    if (routeWr) {
        gpio_func_sel(static_cast<gpio_num_t>(wrGpio), PIN_FUNC_GPIO);
        esp_rom_gpio_connect_out_signal(wrGpio, soc_lcd_i80_signals[kBusId].wr_sig, false, false);
        gpio_set_drive_capability(static_cast<gpio_num_t>(wrGpio), GPIO_DRIVE_CAP_3);   // SRCLK edge
        st->routedWrGpio = wrGpio;
    }
}

// The transfer channel and its descriptor chain, replicating the sibling's setup with two deliberate differences.
// Owner-checking is off: @xref{the-chain-is-ours-so-the-owner-check-protects-nothing|why it only fails here}.
// And the completion callback is the engine's own rather than a peripheral interrupt.
bool initDma(MoonI80State* st, size_t bufferBytes) {
    gdma_channel_alloc_config_t chanCfg = {};
    // The S3's LCD hangs off the AHB GDMA, the P4's off the AXI one, and the descriptor alignment
    // differs with the bus. Same selection esp_lcd makes (esp_lcd_panel_io_i80.c:19-27), including
    // its `defined(...) &&` guard — on a chip with no AXI GDMA the AXI symbol is simply absent, and
    // an unguarded `== SOC_GDMA_BUS_AXI` would compare against the preprocessor's 0 and match.
#if defined(SOC_GDMA_BUS_AXI) && (SOC_GDMA_TRIG_PERIPH_LCD0_BUS == SOC_GDMA_BUS_AXI)
    constexpr size_t kDescAlign = 8;
    if (gdma_new_axi_channel(&chanCfg, &st->dma, nullptr) != ESP_OK) return false;
#else
    constexpr size_t kDescAlign = 4;
    if (gdma_new_ahb_channel(&chanCfg, &st->dma, nullptr) != ESP_OK) return false;
#endif
    if (gdma_connect(st->dma, GDMA_MAKE_TRIGGER(GDMA_TRIG_PERIPH_LCD, 0)) != ESP_OK) return false;

    gdma_strategy_config_t strategy = {};
    strategy.auto_update_desc = true;
    strategy.owner_check = false;   // see (1) above — we own the chain
    if (gdma_apply_strategy(st->dma, &strategy) != ESP_OK) return false;

    gdma_transfer_config_t transfer = {};
    transfer.max_data_burst_size = 64;   // the burst esp_lcd's callers ask for; keeps PSRAM reads efficient
    transfer.access_ext_mem = true;      // the frame usually lives in PSRAM (LCD_CAM GDMA reaches it)
    if (gdma_config_transfer(st->dma, &transfer) != ESP_OK) return false;

    size_t intAlign = 0, extAlign = 0;
    if (gdma_get_alignment_constraints(st->dma, &intAlign, &extAlign) != ESP_OK) return false;
    const size_t bufAlign = intAlign > extAlign ? intAlign : extAlign;

    gdma_link_list_config_t linkCfg = {};
    linkCfg.item_alignment = kDescAlign;
    linkCfg.num_items = esp_dma_calculate_node_count(bufferBytes, bufAlign, kDmaNodeMaxBytes);
    linkCfg.flags.check_owner = false;   // see (1)
    if (gdma_new_link_list(&linkCfg, &st->link) != ESP_OK) return false;

    gdma_tx_event_callbacks_t cbs = {};
    cbs.on_trans_eof = moonI80EofCb;
    return gdma_register_tx_event_callbacks(st->dma, &cbs, st) == ESP_OK;
}

// Allocate one DMA-capable frame buffer, honouring the GDMA's alignment constraints (both the
// address and the length must be a cache-line multiple on the P4 / on PSRAM, or the cache
// write-back before a transfer would touch neighbouring allocations).
uint8_t* allocFrame(MoonI80State* st, size_t bufferBytes, bool psram) {

    size_t intAlign = 0, extAlign = 0;
    gdma_get_alignment_constraints(st->dma, &intAlign, &extAlign);
    const size_t align = psram ? extAlign : intAlign;
    const uint32_t caps = MALLOC_CAP_8BIT | MALLOC_CAP_DMA
                        | (psram ? MALLOC_CAP_SPIRAM : MALLOC_CAP_INTERNAL);
    // Round the size up to the alignment too — gdma_link_mount_buffers checks the LENGTH against the
    // same constraint, and a short tail would fail the mount. The pad is zeroed, so it just extends
    // the frame's trailing latch gap (the lines already idle LOW there).
    const size_t size = align > 1 ? ((bufferBytes + align - 1) / align) * align : bufferBytes;
    return static_cast<uint8_t*>(heap_caps_aligned_calloc(align ? align : 4, 1, size, caps));
}

// One peripheral + GDMA chain + frame buffer(s). `wantSecond` allocates the async double-buffer's
// second frame buffer (best-effort — null if it won't fit); false allocates buffer 0 only. Shared by
// the runtime init and the loopback (which passes false — one transfer).
MoonI80State* createState(const uint16_t* dataPins, uint8_t laneCount,
                          uint16_t wrGpio, size_t bufferBytes, bool wantSecond,
                          uint8_t clockMultiplier) {
    auto* st = new (std::nothrow) MoonI80State();
    if (!st) return nullptr;

    // Bus width is power-of-two only (8 or 16), derived from the lane count: ≤8 → 8, 9..16 → 16.
    st->busWidth = laneCount <= 8 ? 8 : 16;

    // An expander shifts each slot out over several bus words, so the bus must clock proportionally faster to keep the slot inside its window.
    // The shift clock is the bus resolution over the runtime divider, and the init recomputes the exact prescale from the clock tree, so this need only be the intended rate.
    const uint32_t pclkHz = (clockMultiplier > 1) ? (kShiftBusResolutionHz / g_shiftClockDiv) : kPclkHz;
    if (!initPeripheral(st, pclkHz) || !initDma(st, bufferBytes)) {
        destroyState(st);
        return nullptr;
    }
    // WR reaches a pad only when a '595 needs it as the shift clock; a direct-mode strand ignores it,
    // and DC never reaches a pad at all. See configureGpio.
    configureGpio(st, dataPins, laneCount, wrGpio, /*routeWr=*/clockMultiplier > 1);

    st->done[0] = xSemaphoreCreateBinary();
    st->wireFree = xSemaphoreCreateBinary();
    if (!st->done[0] || !st->wireFree) {
        destroyState(st);
        return nullptr;
    }

    // Where the frame lives is decided by the pixel clock rather than its size: @xref{where-the-frame-lives-is-decided-by-the-pixel-clock|the measurement}.
    // The frame itself is not reserve-guarded, unlike the optional second buffer: @xref{only-the-optional-allocation-is-reserve-guarded|why, and why an expander has no external fallback at all}.
    const bool pinExpanderMode = clockMultiplier > 1;
    st->buf[0] = allocFrame(st, bufferBytes, /*psram=*/!pinExpanderMode);
    if (!st->buf[0] && !pinExpanderMode) st->buf[0] = allocFrame(st, bufferBytes, /*psram=*/false);
    if (!st->buf[0]) {
        destroyState(st);
        return nullptr;
    }
    st->cap = bufferBytes;

    // The second buffer, only when asked, arming double buffering if it fits and leaving the driver single-buffered if not.
    // The reserve guards the INTERNAL attempt, whichever that is: the preference order flips with the mode.
    // So binding the guard to a fixed branch would put it on the wrong one half the time.
    // A small helper keeps the rule with the thing it guards.
    if (wantSecond) {
        st->done[1] = xSemaphoreCreateBinary();
        if (st->done[1]) {
            auto tryAlloc = [&](bool psram) -> uint8_t* {
                if (!psram
                    && heap_caps_get_free_size(MALLOC_CAP_DMA | MALLOC_CAP_INTERNAL)
                           < bufferBytes + HEAP_RESERVE) {
                    return nullptr;   // internal, and it would eat the reserve — refuse
                }
                return allocFrame(st, bufferBytes, psram);
            };
            // Same rule as buf[0]: with a pin expander it is internal-or-nothing. A PSRAM buf[1] is worse than no
            // second buffer at all — tickAsync would alternate a working internal buf[0] with a PSRAM
            // buf[1] that never completes, giving exactly one frame at boot and then ~207 ms per tick
            // forever. Refusing it leaves buf[1] null, which the driver reads as "run single-buffered".
            st->buf[1] = tryAlloc(/*psram=*/!pinExpanderMode);
            if (!st->buf[1] && !pinExpanderMode) st->buf[1] = tryAlloc(/*psram=*/false);
            if (!st->buf[1]) {
                vSemaphoreDelete(st->done[1]);
                st->done[1] = nullptr;
            }
        }
    }
    return st;
}

// Program the chain and start the ONE gapless transaction. This is the whole point of the backend:
// esp_lcd's per-transaction reset happens exactly once here, at the START of the single transfer
// that carries the entire frame, never between chunks of it.
bool startTransfer(MoonI80State* st, uint8_t buffer, size_t bytes) {
    lcd_cam_dev_t* dev = st->hal.dev;

    // Write the encoded frame back from cache to physical memory — the GDMA reads DRAM/PSRAM, not
    // the CPU's cache. (esp_lcd does this inside tx_color, esp_lcd_panel_io_i80.c:576.)
    if (esp_cache_get_line_size_by_addr(st->buf[buffer]) > 0) {
        esp_cache_msync(st->buf[buffer], bytes,
                        ESP_CACHE_MSYNC_FLAG_DIR_C2M | ESP_CACHE_MSYNC_FLAG_UNALIGNED);
    }

    // Mount the WHOLE frame in ONE call: the link list splits it across as many 4095-byte nodes as
    // it needs and chains them, so the DMA walks the frame end to end without CPU involvement.
    // mark_eof fires our completion callback on the last node; mark_final NULLs its next-pointer so
    // the DMA stops there instead of wrapping to the head.
    gdma_buffer_mount_config_t mount = {};
    mount.buffer = st->buf[buffer];
    mount.length = bytes;
    mount.flags.mark_eof = true;
    mount.flags.mark_final = GDMA_FINAL_LINK_TO_NULL;
    if (gdma_link_mount_buffers(st->link, 0, &mount, 1, nullptr) != ESP_OK) return false;

    // Data phase only: no command cycles, no dummy cycles, `data_cycles = 1` is a boolean ENABLE —
    // the peripheral clocks whatever the DMA chain feeds it and stops when the chain ends
    // ("Number of data phase cycles are controlled by DMA buffer length", esp_lcd_panel_io_i80.c:778).
    lcd_ll_set_phase_cycles(dev, /*cmd=*/0, /*dummy=*/0, /*data=*/1);
    lcd_ll_set_blank_cycles(dev, 1, 1);
    lcd_ll_reset(dev);
    lcd_ll_fifo_reset(dev);   // discard any FIFO residue from the previous frame

    // Start the transfer engine first, the peripheral only consuming once data has reached its queue.
    // The settle is the sibling's, shortened: at these clocks the queue fills far faster than one word period, so this is ample and keeps the inter-frame gap short.
    if (gdma_start(st->dma, gdma_link_get_head_addr(st->link)) != ESP_OK) return false;
    esp_rom_delay_us(1);
    lcd_ll_start(dev);
    return true;
}

// --- Ring mode ---------------------------------------------------------------------------------------

// Encode one slice straight into the internal buffer the engine is about to read.
// A ring buffer holds rows and nothing else, the reset coming from stopping the peripheral, so a pad written here would land past the allocation.
// The cache sync is a no-op for internal memory but kept for symmetry, and for correctness if a buffer ever lands cache-mapped.
// The chain lives in instruction memory for throughput: flash-resident code shares one cache between both cores, which the render core's churn evicts between firings.
void IRAM_ATTR encodeRingSlice(MoonI80State* st, uint8_t slot, uint32_t firstRow, uint32_t count) {
    // Hand the encoder the buffer-lifecycle fact its prefill-skip hangs on, and consume it: after this
    // call the buffer's constants are laid (or were already), until a memset invalidates them again.
    const bool needsPrefill = st->bufNeedsPrefill[slot];
    st->bufNeedsPrefill[slot] = false;
    st->encode(st->encodeUser, st->ring[slot], firstRow, count, /*closeFrame=*/false, needsPrefill);
    // ringCacheLine is a per-pool constant hoisted to createRingState: the per-refill line-size query was
    // a flash call inside the ISR (illegal on a cache-safe channel, and a needless icache miss before).
    if (st->ringCacheLine > 0) {
        esp_cache_msync(st->ring[slot], static_cast<size_t>(count) * st->ringRowBytes,
                        ESP_CACHE_MSYNC_FLAG_DIR_C2M | ESP_CACHE_MSYNC_FLAG_UNALIGNED);
    }
}

// The one place the slice-fill rule lives, called both by the prime and by the interrupt's refill.
// A buffer holding a real slice gets its rows encoded, and one past the frame's slices is fully zeroed so the loop clocks clean.
// The first past-frame buffer carries the closing latch word at its head, one more latch so the register's final slot presents before the reset.
// True when it ran a real encode rather than a zero fill, since the interrupt times only those and cheap fills would dilute the pace number.
bool IRAM_ATTR fillSlice(MoonI80State* st, uint8_t slot, uint32_t sliceIdx) {
    const uint32_t firstRow = sliceIdx * st->rowsPerBuf;
    if (firstRow < st->totalRows) {
        uint32_t count = st->rowsPerBuf;
        bool shortSlice = false;
        if (firstRow + count >= st->totalRows) {
            count = st->totalRows - firstRow;
            if (count < st->rowsPerBuf) {
                std::memset(st->ring[slot] + static_cast<size_t>(count) * st->ringRowBytes, 0,
                            static_cast<size_t>(st->rowsPerBuf - count) * st->ringRowBytes);
                shortSlice = true;
            }
        }
        encodeRingSlice(st, slot, firstRow, count);
        // AFTER the encode (it consumed this use's prefill flag): the tail memset erased those rows'
        // constants, so the buffer's next full use must re-prefill.
        if (shortSlice) st->bufNeedsPrefill[slot] = true;
        return true;
    }
    std::memset(st->ring[slot], 0, static_cast<size_t>(st->rowsPerBuf) * st->ringRowBytes);
    st->bufNeedsPrefill[slot] = true;   // zero-filled: constants gone until re-prefilled
    if (sliceIdx == st->nSlices)
        st->encode(st->encodeUser, st->ring[slot], st->totalRows, 0,
                   /*closeFrame=*/true, /*needsPrefill=*/false);
    return false;
}

// The barrier between priming and draining. Completion is written-gated, so it leads the wire's actual drain by most of the frame.
// A lapping frame's LAST slices live in its FIRST buffers, exactly the ones the next prime rewrites first, so priming early repaints the bottom rows and no counter sees it.
// Holding the prime until the deterministic wire end closes that race at its only entry point, waiting nothing in the common case.
// Do not instead gate completion on the drain, which deadlocks: a frontier-halted engine fires no completing interrupt.
void waitWireDrained(MoonI80State* st) {
    if (st->lastStopUs == 0) return;   // first-ever frame: no prior wire to drain
    const int64_t now = esp_timer_get_time();
    if (now < st->lastStopUs) esp_rom_delay_us(static_cast<uint32_t>(st->lastStopUs - now));
}

// Prime a range of buffers, each independent, so two cores can prime disjoint ranges concurrently.
// No latch pad, the reset coming from the stop; each caller takes the wire barrier itself, which is idempotent in parallel and keeps the barrier a per-call contract.
void primeRingRange(MoonI80State* st, uint8_t bufLo, uint8_t bufHi) {
    waitWireDrained(st);
    if (bufHi > st->ringBufs) bufHi = st->ringBufs;
    for (uint8_t primed = bufLo; primed < bufHi; primed++)
        fillSlice(st, primed, primed);   // first lap: buffer index IS the slice index
}

// Arm the primed ring: peripheral setup, the timed WS2812-reset guard, the oracle epoch, gdma_start.
// Every buffer must be primed (primeRingRange over the whole pool — serial or fork-joined) BEFORE this
// runs; the caller owns that ordering (the driver's join is the fence).
bool armRingTransfer(MoonI80State* st) {
    lcd_cam_dev_t* dev = st->hal.dev;
    st->drainCount = 0;
    st->busy = true;
    // Priming wrote slices 0..ringBufs-1 (real ones encoded, the rest zero-filled) — the batch refill's
    // cursor continues from there.
    st->lastWrittenSlice = st->ringBufs - 1u;

    // When the frame laps, rebuild the chain linear and terminate it at the prime frontier before every arm, so it ends exactly where written data ends.
    // Re-linking each frame rather than once at mount is what lets the terminator travel: the previous frame left it wherever its last refill put it.
    // A chain that never laps is self-terminated at mount and needs no re-link.
    if (st->nSlices > st->ringBufs) {
        // The previous frame's DMA halted itself at the frontier NULL; force it fully stopped before we
        // rewrite its descriptors so no in-flight prefetch reads a half-edited link. gdma_start(head)
        // below re-arms from the head cleanly. (First arm: the channel is idle already — a no-op stop.)
        gdma_stop(st->dma);
        for (uint8_t b = 0; b + 1u < st->ringBufs; b++)
            gdma_link_concat(st->link, ringTailNode(st, b), st->link, st->bufLastNode[b + 1u]);
        gdma_link_concat(st->link, ringTailNode(st, st->ringBufs - 1u), nullptr, 0);   // frontier NULL
    }

    lcd_ll_set_phase_cycles(dev, /*cmd=*/0, /*dummy=*/0, /*data=*/1);
    lcd_ll_set_blank_cycles(dev, 1, 1);
    lcd_ll_reset(dev);
    lcd_ll_fifo_reset(dev);

    // Guarantee the reset by holding the arm until the strand has idled long enough since the last frame stopped.
    // At normal rates the render loop's own gap already exceeds it, so this waits nothing in the common case and busy-waits only the remainder on back-to-back frames.
    // Sizing the reset by TIME rather than by tail-buffer count is what makes a small pool render at all.
    if (st->lastStopUs != 0) {
        const int64_t lowSoFar = esp_timer_get_time() - st->lastStopUs;
        if (lowSoFar < kResetLowUs) esp_rom_delay_us(static_cast<uint32_t>(kResetLowUs - lowSoFar));
    }

