MoonModules/projectMM/src/platform/esp32/platform_esp32_moon_i80.cpp
    st->txStartUs[0] = esp_timer_get_time();
    st->armUs = st->txStartUs[0];   // the clock oracle's epoch: drain position = (now − armUs) / sliceNs
    if (gdma_start(st->dma, gdma_link_get_head_addr(st->link)) != ESP_OK) {
        st->busy = false;
        return false;
    }
    esp_rom_delay_us(1);
    lcd_ll_start(dev);
    return true;
}

// The serial combo (prime everything, then arm) — the single-core path, and what the dual-core driver
// falls back to when its helper is unavailable.
bool startRingTransfer(MoonI80State* st) {
    primeRingRange(st, 0, st->ringBufs);
    return armRingTransfer(st);
}


// GDMA channel + the link list the ring circulates. Mirrors initDma (channel alloc / connect / strategy /
// transfer / EOF callback); the chain itself is described where it is mounted, in createRingState.
bool initRingDma(MoonI80State* st) {
    gdma_channel_alloc_config_t chanCfg = {};
    // The deadline race runs at interrupt-dispatch granularity, so this interrupt takes a priority no render-thread interrupt can delay, and a cache-safe registration so a flash write delays nothing.
    // The whole handler chain is resident in instruction memory, which is what makes that registration legal.
    chanCfg.intr_priority = 3;
    chanCfg.flags.isr_cache_safe = true;
#if defined(SOC_GDMA_BUS_AXI) && (SOC_GDMA_TRIG_PERIPH_LCD0_BUS == SOC_GDMA_BUS_AXI)
    constexpr size_t kDescAlign = 8;
    if (gdma_new_axi_channel(&chanCfg, &st->dma, nullptr) != ESP_OK) return false;
#else
    constexpr size_t kDescAlign = 4;
    if (gdma_new_ahb_channel(&chanCfg, &st->dma, nullptr) != ESP_OK) return false;
#endif
    if (gdma_connect(st->dma, GDMA_MAKE_TRIGGER(GDMA_TRIG_PERIPH_LCD, 0)) != ESP_OK) return false;

    gdma_strategy_config_t strategy = {};
    // Descriptor write-back stays off: @xref{descriptor-write-back-stays-off|the polite halt it otherwise causes}.
    // The owner check stays off too, since an owner gate is never wanted here at all.
    strategy.auto_update_desc = false;
    strategy.owner_check = false;
    if (gdma_apply_strategy(st->dma, &strategy) != ESP_OK) return false;

    gdma_transfer_config_t transfer = {};
    transfer.max_data_burst_size = 64;
    transfer.access_ext_mem = false;   // ring buffers are INTERNAL — the whole point (no PSRAM at the shift clock)
    if (gdma_config_transfer(st->dma, &transfer) != ESP_OK) return false;

    size_t intAlign = 0, extAlign = 0;
    if (gdma_get_alignment_constraints(st->dma, &intAlign, &extAlign) != ESP_OK) return false;

    st->nSlices = (st->totalRows + st->rowsPerBuf - 1) / st->rowsPerBuf;

    // The frontier-terminated chain: @xref{the-frontier-terminated-chain|why it is not a loop, and what every node carries}.
    const size_t rowsOnlyBytes = static_cast<size_t>(st->rowsPerBuf) * st->ringRowBytes;
    const size_t itemsPerBuf = esp_dma_calculate_node_count(rowsOnlyBytes, intAlign, kDmaNodeMaxBytes);
    st->itemsPerBuf = static_cast<uint8_t>(itemsPerBuf);   // the ISR splices the self-terminating NULL by node index
    // One extra node per buffer when the inter-buffer zero-pad is on (each pad node re-mounts the SAME
    // shared zero block; zeroPadBytes ≤ kDmaNodeMaxBytes by the kRingPadMaxUs bound, so one node each).
    const size_t padItems = st->zeroPad ? st->ringBufs : 0;
    const size_t numItems = itemsPerBuf * st->ringBufs + padItems;

    st->linkItemCap = numItems;

    gdma_link_list_config_t linkCfg = {};
    linkCfg.item_alignment = kDescAlign;
    linkCfg.num_items = numItems;
    linkCfg.flags.check_owner = false;
    if (gdma_new_link_list(&linkCfg, &st->link) != ESP_OK) return false;

    gdma_tx_event_callbacks_t cbs = {};
    cbs.on_trans_eof = moonI80EofCb;
    cbs.on_descr_err = moonI80DescErrCb;   // B1-DISCRIMINATOR (diagnostic): catch the silent descriptor-fetch halt
    return gdma_register_tx_event_callbacks(st->dma, &cbs, st) == ESP_OK;
}

// Bring up the peripheral + N internal ring buffers + the linear chain. The peripheral setup mirrors
// createState (same clock, GPIO routing, DC/WR handling) — only the DMA + buffers differ. Returns null
// (and the caller falls back to the whole-frame path) if any internal buffer or the chain won't fit.
MoonI80State* createRingState(const uint16_t* dataPins, uint8_t laneCount, uint16_t wrGpio,
                              size_t rowBytes, uint32_t totalRows,
                              uint32_t rowsPerBuf, uint8_t ringBufs, uint8_t padUs,
                              uint8_t clockMultiplier, MoonI80EncodeFn encode, void* user) {
    auto* st = new (std::nothrow) MoonI80State();
    if (!st) return nullptr;
    st->isRing = true;
    st->busWidth = laneCount <= 8 ? 8 : 16;
    st->ringRowBytes = rowBytes;
    st->totalRows = totalRows;
    st->padUs = padUs;
    // One buffer is one descriptor node, a structural rule enforced here: @xref{one-buffer-is-one-descriptor-node|what spanning several broke}.
    // The clamp has a floor of one row, since a single row larger than a node cannot ring at all and the driver falls back to whole-frame.
    const uint32_t maxRowsPerNode = rowBytes ? static_cast<uint32_t>(kDmaNodeMaxBytes / rowBytes) : 1u;
    const uint32_t rowsClamped = rowsPerBuf > maxRowsPerNode ? (maxRowsPerNode ? maxRowsPerNode : 1u)
                                                             : rowsPerBuf;
    // The geometry, before initRingDma — it derives nSlices and the descriptor-pool size from both.
    st->rowsPerBuf = rowsClamped;
    st->ringBufs = ringBufs;

    st->encode = encode;
    st->encodeUser = user;
    st->cap = st->rowsPerBuf * rowBytes;   // reported buffer capacity (one ring buffer — ROWS ONLY, no pad)

    // Shift mode: the '595 SRCLK = the 80 MHz bus resolution / the runtime shiftClockDiv (default 4 =
    // 20 MHz). initPeripheral recomputes the exact prescale from the clock tree, so this only needs
    // to be the intended rate. Direct mode is unaffected (kPclkHz).
    const uint32_t pclkHz = (clockMultiplier > 1) ? (kShiftBusResolutionHz / g_shiftClockDiv) : kPclkHz;
    // The clock oracle's tick: one slice's exact wire duration in ns. The bus clocks busWidth/8 bytes per
    // pclk, so ns = bytes × 8e9 / (busWidth × pclkHz); the inter-buffer pad (below) extends every slice's
    // slot by padUs. Exact integer math — the oracle's only error source is esp_timer resolution (µs).
    const uint64_t sliceWireNs = (static_cast<uint64_t>(st->rowsPerBuf) * rowBytes * 8u * 1'000'000'000ull)
                                 / (static_cast<uint64_t>(st->busWidth) * pclkHz);
    st->sliceNs = static_cast<uint32_t>(sliceWireNs);   // + the pad below, once it is actually mounted
    // The geometry initRingDma sizes the pool from — computed here too because the pad decision needs it.
    st->nSlices = (st->totalRows + st->rowsPerBuf - 1u) / st->rowsPerBuf;
    // The shared pad block, used only where there is a refill deadline to stretch: one block every pad node references, sized in bus time and aligned.
    // Zeros on the expander bus read as a strand-level pause, and the bound keeps that pause far under the latch threshold.
    if (padUs > 0 && st->nSlices > st->ringBufs) {
        const uint64_t padBytes64 = (static_cast<uint64_t>(padUs) * pclkHz * st->busWidth) / (8u * 1'000'000ull);
        st->zeroPadBytes = static_cast<size_t>(padBytes64) & ~size_t{7};
        if (st->zeroPadBytes > 0) {
            st->zeroPad = allocFrame(st, st->zeroPadBytes, /*psram=*/false);
            if (!st->zeroPad) {   // pad requested but unfittable: fail loud, caller falls back
                ESP_LOGE(MOON_I80_TAG, "ring init failed: zero-pad alloc (%u B)", (unsigned)st->zeroPadBytes);
                destroyState(st);
                return nullptr;
            }
            // The oracle's tick includes the pad's EXACT wire time (the mounted bytes, not the requested
            // µs — they differ by the alignment round-down).
            st->sliceNs += static_cast<uint32_t>(
                (static_cast<uint64_t>(st->zeroPadBytes) * 8u * 1'000'000'000ull)
                / (static_cast<uint64_t>(st->busWidth) * pclkHz));
        } else {
            st->zeroPadBytes = 0;
        }
    }
    if (!initPeripheral(st, pclkHz)) {
        ESP_LOGE(MOON_I80_TAG, "ring init failed: peripheral (LCD_CAM) setup");
        destroyState(st);
        return nullptr;
    }
    if (!initRingDma(st)) {
        ESP_LOGE(MOON_I80_TAG, "ring init failed: GDMA channel/descriptor setup");
        destroyState(st);
        return nullptr;
    }
    configureGpio(st, dataPins, laneCount, wrGpio, /*routeWr=*/clockMultiplier > 1);

