MoonModules/projectMM/src/platform/esp32/platform_esp32_moon_i80.cpp
    st->done[0] = xSemaphoreCreateBinary();   // the render thread's frame-complete wait (given on the last slice)
    if (!st->done[0]) {
        ESP_LOGE(MOON_I80_TAG, "ring init failed: done semaphore");
        destroyState(st);
        return nullptr;
    }

    // N internal ring buffers, each one slice + the latch pad (the LAST slice appends the pad; sizing
    // every buffer to hold it keeps them uniform and lets any buffer be the last one).
    const size_t bufBytes = static_cast<size_t>(st->rowsPerBuf) * rowBytes;
    for (uint8_t i = 0; i < st->ringBufs; i++) {
        st->ring[i] = allocFrame(st, bufBytes, /*psram=*/false);
        if (!st->ring[i]) {
            ESP_LOGE(MOON_I80_TAG, "ring init failed: buffer %u/%u alloc (%u B, free DMA %u B)",
                     (unsigned)i, (unsigned)st->ringBufs, (unsigned)bufBytes,
                     (unsigned)heap_caps_get_free_size(MALLOC_CAP_DMA | MALLOC_CAP_INTERNAL));
            destroyState(st);
            return nullptr;
        }
        st->bufNeedsPrefill[i] = true;   // fresh (zeroed) buffer: no constants laid yet
    }
    // Cache-line size is a per-pool constant (all buffers come from the same internal-DMA heap) — hoisted
    // here so the refill never makes the (flash-resident) query inside the now cache-safe ISR.
    st->ringCacheLine = esp_cache_get_line_size_by_addr(st->ring[0]);

    // Mount the chain, self-terminating from creation rather than spliced at runtime, which raced the still-walking engine and was index-fragile.
    // A geometry whose frame fits the pool has a fixed length and a fixed terminator, the zero tail past the last real slice, so re-arming is a plain start.
    // One that laps can have no fixed terminator, so it is mounted linear and the arm plants the frontier: @xref{the-frontier-terminated-chain|the rule}.
    const bool primeOnly = st->nSlices <= st->ringBufs;
    const uint32_t termBuf = primeOnly
        ? (st->nSlices < st->ringBufs ? st->nSlices : st->ringBufs - 1u)   // the zero reset-tail buffer
        : st->ringBufs;   // sentinel "none" for the lapping case (no buffer gets LINK_TO_NULL)
    const size_t rowsOnly = static_cast<size_t>(st->rowsPerBuf) * rowBytes;   // node length: rows, NO pad
    // Mount up to and including the terminator, then stop: each mount re-links the previous node to the one it mounts.
    // So mounting one more would overwrite the end we just set and the chain would loop forever.
    // The engine never reaches buffers past the terminator, so leaving them unmounted is correct.
    const uint8_t mountCount = primeOnly ? static_cast<uint8_t>(termBuf + 1u) : st->ringBufs;
    // With a pad, one pad node is interleaved after every data node, each re-mounting the SAME shared zero block, which is only more mount calls.
    // The pad reads as a strand-level pause after each slice, stretching the refill deadline by its wire time.
    // The end mark stays on the data nodes, whose drain is the one that needs an interrupt.
    const bool padded = !primeOnly && st->zeroPad != nullptr;
    int idx = 0;
    bool mountOk = true;
    for (uint8_t b = 0; b < mountCount && mountOk; b++) {
        const bool last = (b == mountCount - 1);
        gdma_buffer_mount_config_t mount = {};
        mount.buffer = st->ring[b];
        mount.length = rowsOnly;   // rows only — continuous stream, no inter-buffer LOW gap (see initRingDma)
        // When the whole frame is primed before arming, the interrupt fires ONCE per frame, on the terminator alone.
        // Counting per-buffer completions would be unsound, the status being a latch: two coalesce while the handler is delayed and the count undercounts.
        // Completion then never fires and the driver gives up, measured as every large configuration dying within a few dozen frames.
        // A lapping geometry keeps per-buffer interrupts, its handler genuinely refilling per drain.
        mount.flags.mark_eof = primeOnly ? (b == termBuf) : true;
        // Prime-only: the reset-tail buffer self-terminates (NULL); every other node → next (DEFAULT).
        // Lapping: every node → next (DEFAULT). The lapping chain never loops to HEAD — armRingTransfer
        // re-links it linear and plants the frontier NULL at the prime edge, and the ISR advances that NULL.
        // A DEFAULT link on the last mounted node is a don't-care: armRingTransfer overwrites it before arm.
        mount.flags.mark_final = (b == termBuf) ? GDMA_FINAL_LINK_TO_NULL : GDMA_FINAL_LINK_TO_DEFAULT;
        int endIdx = 0;
        if (idx >= static_cast<int>(st->linkItemCap)) mountOk = false;
        else if (gdma_link_mount_buffers(st->link, idx, &mount, 1, &endIdx) != ESP_OK) mountOk = false;
        else st->bufLastNode[b] = endIdx;   // buffer b's real last node (kept for the lapping ISR splice)
        idx = endIdx + 1;
        if (padded && mountOk) {
            gdma_buffer_mount_config_t pad = {};
            pad.buffer = st->zeroPad;
            pad.length = st->zeroPadBytes;
            pad.flags.mark_eof = false;   // the pad's drain is dead time; the data node's EOF drives the ISR
            // Every pad node → next (DEFAULT). The last one is a don't-care too — armRingTransfer re-links
            // the chain (through each buffer's tail node = its pad, ringTailNode) and plants the frontier.
            pad.flags.mark_final = GDMA_FINAL_LINK_TO_DEFAULT;
            (void)last;
            int padEnd = 0;
            if (idx >= static_cast<int>(st->linkItemCap)) mountOk = false;
            else if (gdma_link_mount_buffers(st->link, idx, &pad, 1, &padEnd) != ESP_OK) mountOk = false;
            idx = padEnd + 1;
        }
    }
    st->consumedItems = static_cast<uint32_t>(idx);   // diagnostic: exposed via moonI80Ws2812RingStats
    // SELF-TERM DIAG (temp): the actual mount-time NULL terminator node, for the ringDbg readout.
    st->termNode = primeOnly ? st->bufLastNode[termBuf] : -1;
    if (!mountOk) { destroyState(st); return nullptr; }

    // No refill task: the EOF ISR encodes the next slice inline as each buffer drains (see moonI80EofCb).
    // That is the reuse-race fix — an interrupt-priority refill always beats the DMA lapping into a reused
    // buffer, which a lower-priority task could lose to wake latency at >8 slices (≥192 lights/strand).
    return st;
}

// Abandon the in-flight transfer and return the peripheral to a clean idle, the one recovery both backstops share.
// A lost interrupt leaves the busy flag stuck with nothing to clear it, and the bus then wedges permanently.
// So this stops the peripheral and the engine, clears the flag, and marks the strand as idling now, holding the next arm's reset window.
// The condition and any mode-specific residue stay at the call sites, so the two paths cannot drift in how they leave the hardware.
void finalizeStalledTransfer(MoonI80State* st) {
    lcd_ll_stop(st->hal.dev);
    gdma_stop(st->dma);
    st->busy = false;
    st->lastStopUs = esp_timer_get_time();
    st->dbgStallAbandons = st->dbgStallAbandons + 1u;
}

