MoonModules/projectMM/src/platform/esp32/platform_esp32_moon_i80.cpp
bool moonI80Ws2812Wait(MoonI80Ws2812Handle& h, uint8_t buffer, uint32_t timeoutMs) {
    auto* st = static_cast<MoonI80State*>(h.impl);
    if (!st || buffer >= 2 || !st->done[buffer]) return true;   // nothing to wait on = not in flight
    // Report whether the transfer actually completed. On a timeout the DMA may still be reading this
    // buffer, so the caller must keep it marked in-flight rather than re-encoding into it — handing a
    // live DMA a half-rewritten buffer is exactly the frame corruption the timeout is meant to avoid.
    if (xSemaphoreTake(st->done[buffer], pdMS_TO_TICKS(timeoutMs)) == pdTRUE) return true;

    // The ring's stall backstop: @xref{two-stall-backstops-one-recovery|the window that outlasts the pool's lead}.
    // The next arm re-links the chain and plants a fresh frontier, so no residual state carries over.
    if (st->isRing && st->busy && st->nSlices > st->ringBufs
        && st->lastWrittenSlice < st->nSlices + kTailBufs) {   // kTailBufs (file scope), not a bare +1
        const int64_t frameWireUs = (static_cast<int64_t>(st->nSlices) * st->sliceNs) / 1000;
        if (esp_timer_get_time() - st->armUs >= frameWireUs) {
            finalizeStalledTransfer(st);   // the shared stop-and-clear; the next arm re-links the chain
            // Latch whatever this frame's refills managed, so the ea readout isn't stuck at a half window.
            st->dbgEncAvgUs = st->dbgEncCount ? st->dbgEncSumUs / st->dbgEncCount : st->dbgEncAvgUs;
            st->dbgEncSumUs = 0;
            st->dbgEncCount = 0;
        }
    }

    // The whole-frame path's stall backstop: @xref{two-stall-backstops-one-recovery|the lost interrupt this recovers from}.
    // Its own residue is draining the completion queue, so the abandoned entry cannot be popped by a late interrupt against the next frame.
    if (!st->isRing && st->busy) {
        finalizeStalledTransfer(st);   // stop LCD + GDMA FIRST, so no EOF can fire during the drain below
        st->fifoTail = st->fifoHead;   // then drop the un-completed entry; the ISR guard ignores a late EOF
    }
    return false;   // the caller keeps the buffer in-flight for this frame; the next frame arms fresh
}

uint32_t moonI80Ws2812LastTransmitUs(const MoonI80Ws2812Handle& h) {
    auto* st = static_cast<MoonI80State*>(h.impl);
    return st ? st->lastTransmitUs : 0;
}

MoonI80RingStats moonI80Ws2812RingStats(const MoonI80Ws2812Handle& h) {
    MoonI80RingStats s;
    auto* st = static_cast<MoonI80State*>(h.impl);
    if (!st || !st->isRing) return s;
    s.isRing        = true;
    s.nSlices       = st->nSlices;
    s.ringBufs      = st->ringBufs;
    s.eofTotal      = st->dbgEofTotal;
    s.cacheOffDefers = st->dbgCacheOffDefers;
    s.cacheOffMaxRun = st->dbgCacheOffMaxRun;
    s.stallAbandons = st->dbgStallAbandons;
    s.doneGiven     = st->dbgDoneGiven;
    s.lastDrain     = st->dbgLastDrain;
    s.numItems      = static_cast<uint32_t>(st->linkItemCap);
    s.consumedItems = st->consumedItems;
    s.descErr       = st->dbgDescErr;
    s.maxEncodeUs   = st->dbgMaxEncodeUs;
    s.avgEncodeUs   = st->dbgEncAvgUs;
    s.maxIsrGapUs   = st->dbgMaxIsrGapUs;
    s.itemsPerBuf   = st->itemsPerBuf;
    s.termNodeDiag  = st->termNode;
    s.late          = st->dbgLate;
    return s;
}

void moonI80Ws2812Deinit(MoonI80Ws2812Handle& h) {
    auto* st = static_cast<MoonI80State*>(h.impl);
    if (!st) return;
    destroyState(st);
    h.impl = nullptr;
}

// The loopback self-test: a private full-width setup on the driver's real pins transmits the caller's real frame, exactly like the render loop.
// A receive channel captures it off the jumpered pin and verifies every bit.
// A short synthetic burst would miss exactly the failures a real frame hits, so the test sends the genuine article.
// The capture and verify half is shared with the sibling loopbacks; only the transmit differs.

namespace detail {
void captureAndVerifyFrame(uint16_t rxGpio, size_t frameBytes, size_t dataBytes,
                           uint8_t rowBits, uint32_t pclkHz, bool pinExpanderMode, const char* tag,
                           const std::function<void()>& transmitOnce,
                           RmtLoopbackResult& r, bool rideMode = false,
                           uint32_t* rxSymbols = nullptr);
// Pre-allocate the capture buffer, one contiguous internal block, so a caller can take it before its own allocations fragment the heap.
// Ownership transfers regardless of outcome, and passing nothing on failure is fine: the helper retries and reports it.
uint32_t* allocLoopbackCapture(size_t dataBytes);
}

RmtLoopbackResult moonI80Ws2812Loopback(const uint16_t* dataPins, uint8_t laneCount,
                                        uint16_t wrGpio, uint16_t rxGpio,
                                        const uint8_t* frame, size_t frameBytes,
                                        size_t dataBytes, uint8_t rowBits,
                                        uint8_t clockMultiplier,
                                        uint32_t ringRows, uint32_t ringBufs,
                                        bool useRingArg) {
    RmtLoopbackResult r;
    r.sent[0] = 0xA5; r.sent[1] = 0x00; r.sent[2] = 0xFF;  // pattern in every row
    if (!dataPins || laneCount == 0 || !frame || frameBytes == 0
        || dataBytes < 3 || dataBytes > frameBytes || rowBits < 8
        || clockMultiplier == 0) return r;
    const uint16_t txGpio = dataPins[0];   // lane 0 carries the pattern
    const bool pinExpanderMode = clockMultiplier > 1;

    if (pinExpanderMode) {
        // Skip the continuity pre-check, which expects the receive pin to follow the transmit one directly.
        // True of a bare jumper and false through an expander, where raising the input raises no output until a latch.
        // It would report no jumper on perfectly good wiring, and the bit-verify is the stronger check anyway, validating the whole chain.
        r.jumperDetected = true;
    } else {
        r.jumperDetected = detail::loopbackJumperOk(static_cast<uint8_t>(txGpio),
                                                    static_cast<uint8_t>(rxGpio));
        if (!r.jumperDetected) return r;
    }

