MoonModules/projectMM/src/platform/esp32/platform_esp32_moon_i80.cpp
    // The loopback follows the same rule the render path does: @xref{the-loopback-follows-the-same-rule-the-render-path-does|why, and what its encode becomes}.
    // It rides the ring when the driver asked for it, the render path being on the ring so the self-test must be too.
    // Or when the frame would overflow internal memory.
    const bool useRing = pinExpanderMode && (useRingArg || !moonI80Ws2812InternalFits(frameBytes));
    const uint8_t sb = laneCount <= 8 ? 1 : 2;
    // rowBytes = outCh(=rowBits/8) × 8 × 3 × slotBytes × outputsPerPin(=clockMultiplier in shift mode).
    const size_t loopRowBytes = static_cast<size_t>(rowBits) * 3u * sb * clockMultiplier;
    // The row count is the strand's light count and must come from strand-side units: @xref{the-loopback-follows-the-same-rule-the-render-path-does|why bus bytes mix units}.
    const uint32_t rowStrandBytes = static_cast<uint32_t>(rowBits) * 3u;
    const uint32_t loopRows = rowStrandBytes ? static_cast<uint32_t>(dataBytes / rowStrandBytes) : 0;

    // Grab the capture buffer FIRST: it is the loopback's one big contiguous DMA block (~4 B per
    // WS2812 bit), and the ring init below fragments internal RAM with its per-buffer nodes — in that
    // order the capture alloc fails on a busy heap and the test dies as "no capture" before
    // transmitting a bit. Largest-first fixes it; ownership passes to captureAndVerifyFrame.
    uint32_t* rxSymbols = detail::allocLoopbackCapture(dataBytes);

    MoonI80State* st = nullptr;
    // The copy-slice encoder: the frame is already encoded, so a slice is a straight copy out of it, its geometry riding in the seam's own user pointer.
    // Rows only, like every ring slice, so the pre-built frame's trailing pad is not copied: a ring buffer holds rows and nothing else, and the pad has nowhere to go.
    struct LoopCopyCtx { const uint8_t* frame; size_t rowBytes; uint32_t rows; size_t slotBytes; };
    LoopCopyCtx ctx{frame, loopRowBytes, loopRows, sb};
    if (useRing && loopRows > 0) {
        auto copySlice = [](void* user, uint8_t* dst, uint32_t firstRow, uint32_t count, bool close,
                            bool /*needsPrefill*/) {   // a full memcpy re-writes constants + data alike
            auto* c = static_cast<LoopCopyCtx*>(user);
            if (count == 0) {
                // The frame-close call: the pre-built frame's pad HEAD is exactly the latch-only word
                // (encodeWs2812ShiftLatchPad wrote it there) — copy that one word.
                if (close) std::memcpy(dst, c->frame + static_cast<size_t>(c->rows) * c->rowBytes, c->slotBytes);
                return;
            }
            std::memcpy(dst, c->frame + static_cast<size_t>(firstRow) * c->rowBytes,
                        static_cast<size_t>(count) * c->rowBytes);
        };
        MoonI80Ws2812Handle h;
        // Prefer the driver's LIVE geometry, so the self-test streams through the same ring the render path is tuned to.
        // A scattered margin then shows as a bit fault at the same slice boundary the eyes see on the wall.
        // Zero takes the platform default, so a caller that does not care still works, and the depth steps down on a memory-tight heap.
        const uint32_t loopRingRows = ringRows ? ringRows : kRingRowsDefault;
        // The live depth when memory allows, else stepping down until the init's gate accepts.
        // The capture buffer already holds several bytes per bit of the same pool, and both do not fit a tight board.
        // A shallower ring still verifies the same chain, only the refill margin differing.
        // The copy refill is far faster than a render encode, so even a minimal pool streams clean.
        uint32_t tryBufs = ringBufs ? ringBufs : kRingBufsDefault;
        while (tryBufs >= kRingBufsMin) {
            if (moonI80Ws2812InitRing(h, dataPins, laneCount, wrGpio, loopRowBytes, loopRows,
                                      loopRingRows, tryBufs, /*padUs=*/0, clockMultiplier, copySlice,
                                      &ctx)) {
                st = static_cast<MoonI80State*>(h.impl);
                break;
            }
            tryBufs /= 2;
        }
    }
    // Whole-frame fallback (direct mode, or a frame that fits internal): the original private bus + copy.
    if (!st) {
        // The continuity check above reset txGpio's GPIO matrix route; createState re-claims it.
        st = createState(dataPins, laneCount, wrGpio, frameBytes, /*wantSecond=*/false, clockMultiplier);
        if (!st) {
            ESP_LOGE(MOON_I80_TAG, "loopback: private peripheral setup failed");
            heap_caps_free(rxSymbols);   // ownership never reached captureAndVerifyFrame
            return r;
        }
        std::memcpy(st->buf[0], frame, frameBytes);   // loopback uses buffer 0 only (single transfer)
    }
    const bool loopIsRing = st->isRing;

    // Ship one frame and wait for its completion, everything else being the shared helper.
    // This is the runtime path's bookkeeping minus the handle indirection, surfacing a failed arm or a timeout rather than letting either show up only as a later capture mismatch.
    auto transmitOnce = [st, frameBytes, loopIsRing]() {
        bool armed;
        if (loopIsRing) {
            armed = startRingTransfer(st);
        } else {
            st->fifo[st->fifoHead] = 0;
            st->txStartUs[st->fifoHead] = esp_timer_get_time();
            st->fifoHead = (st->fifoHead + 1u) & 1u;
            st->busy = true;
            armed = startTransfer(st, 0, frameBytes);
            if (!armed) {
                st->fifoHead = (st->fifoHead + 1u) & 1u;   // unwind the push
                st->busy = false;
            }
        }
        if (!armed) { ESP_LOGE(MOON_I80_TAG, "loopback: tx arm failed"); return; }
        if (xSemaphoreTake(st->done[0], pdMS_TO_TICKS(1000)) != pdTRUE)
            ESP_LOGE(MOON_I80_TAG, "loopback: tx EOF timed out");
    };
    // The rate passed here is the SLOT rate the strand sees, which sets the verifier's pulse threshold and expected duration.
    // So it must describe the strand rather than the bus: in expander mode several bus words fill one slot, so the rate divides by that multiplier.
    // Passing the bus rate sized the window far too short and decoded nothing on a working strand.
    // It is derived from the runtime divider rather than a constant, or a non-default one makes the capture expect the wrong widths.
    const uint32_t slotHz = pinExpanderMode
        ? (kShiftBusResolutionHz / g_shiftClockDiv / clockMultiplier) : kPclkHz;
    detail::captureAndVerifyFrame(rxGpio, frameBytes, dataBytes, rowBits, slotHz, pinExpanderMode,
                                  MOON_I80_TAG, transmitOnce, r, /*rideMode=*/false, rxSymbols);
    destroyState(st);
    return r;
}

} // namespace mm::platform

#else  // !SOC_LCDCAM_I80_LCD_SUPPORTED — inert stubs so a chip without LCD_CAM links

namespace mm::platform {

bool moonI80Ws2812Init(MoonI80Ws2812Handle&, const uint16_t*, uint8_t, uint16_t, uint16_t,
                       size_t, bool, uint8_t) {
    return false;
}
bool moonI80Ws2812InitRing(MoonI80Ws2812Handle&, const uint16_t*, uint8_t, uint16_t, size_t,
                           uint32_t, uint32_t, uint8_t, uint8_t, uint8_t, MoonI80EncodeFn, void*) {
    return false;
}
bool moonI80Ws2812TransmitRing(MoonI80Ws2812Handle&) { return false; }
void moonI80SetShiftClockDiv(uint8_t) {}
void moonI80Ws2812PrimeRange(MoonI80Ws2812Handle&, uint8_t, uint8_t) {}
bool moonI80Ws2812ArmRing(MoonI80Ws2812Handle&) { return false; }
bool moonI80Ws2812IsRing(const MoonI80Ws2812Handle&) { return false; }
bool moonI80Ws2812InternalFits(size_t) { return false; }
uint8_t* moonI80Ws2812Buffer(const MoonI80Ws2812Handle&, uint8_t) { return nullptr; }
size_t moonI80Ws2812BufferCapacity(const MoonI80Ws2812Handle&) { return 0; }
bool moonI80Ws2812Transmit(MoonI80Ws2812Handle&, uint8_t, size_t) { return false; }
bool moonI80Ws2812Wait(MoonI80Ws2812Handle&, uint8_t, uint32_t) { return true; }
uint32_t moonI80Ws2812LastTransmitUs(const MoonI80Ws2812Handle&) { return 0; }
MoonI80RingStats moonI80Ws2812RingStats(const MoonI80Ws2812Handle&) { return {}; }
void moonI80Ws2812Deinit(MoonI80Ws2812Handle&) {}
RmtLoopbackResult moonI80Ws2812Loopback(const uint16_t*, uint8_t, uint16_t, uint16_t,
                                        uint16_t, const uint8_t*, size_t, size_t, uint8_t,
                                        uint8_t, uint32_t, uint32_t, bool) {
    return {};
}

} // namespace mm::platform

#endif  // SOC_LCDCAM_I80_LCD_SUPPORTED
